#include <iostream>
#include <fstream>

using namespace std;

class Blockchain{
private:
    string data_filename;
    //добавить инициализацию блокчейна из файла.
    //добавить возможность добавения блока в файл с блокчейном
    /*
    Этот класс должен включать в себе функции мастер-ноды, которая проверяет на корректность текущий блокчейн.
    Блокчейн будет храниться в файле, для него не будет выделятся динамическая память. Этот класс должен обеспечивать
    работу с этим файлом, совмещая в себе функции мастер-ноды.
    */
};